*&---------------------------------------------------------------------*
*& Module Pool      SAPMZEA_PPT100
*&---------------------------------------------------------------------*
*& [SD] 판매오더 관리 2024.04.24 [완료] - ACA5-15 유연수
*&---------------------------------------------------------------------*
*& [2024.04.22 / 단위 테스트 완료] - [PM] 김건우 : o  (조회만 확인)
*&---------------------------------------------------------------------*

INCLUDE MZEA_SD040TOP.
*INCLUDE MZEA_SD_A04TOP.
INCLUDE MZEA_SD040CLS.
*INCLUDE MZEA_SD_A04CLS.
INCLUDE MZEA_SD040O01.
*INCLUDE MZEA_SD_A04O01.
INCLUDE MZEA_SD040I01.
*INCLUDE MZEA_SD_A04I01.
INCLUDE MZEA_SD040F01.
*INCLUDE MZEA_SD_A04F01.
