*&---------------------------------------------------------------------*
*& Report ZALV_GRID_DISPLAY
*&---------------------------------------------------------------------*
*& 출하 / 배송 조회
*&---------------------------------------------------------------------*
*& [2024.04.22 / 단위 테스트 요청] - [SD] 유연수
*& [2024.04. / 단위 테스트 완료] - [PM] 김건우 :
*&---------------------------------------------------------------------*

REPORT ZEA_SD070 MESSAGE-ID ZMSG_E23.

INCLUDE ZEA_SD070_TOP.
INCLUDE ZEA_SD070_SCR.
INCLUDE ZEA_SD070_CLS.
INCLUDE ZEA_SD070_PBO.
INCLUDE ZEA_SD070_PAI.
INCLUDE ZEA_SD070_F01.

*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM INIT_DATA.

*----------------------------------------------------------------------*
* AT SELECTION SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM MODIFY_SSCREEN.

*----------------------------------------------------------------------*
* AT SELECTION SCREEN
*----------------------------------------------------------------------*
* AT SELECTION-SCREEN ON BLOCK B01.
* PERFORM CHECK_INPUT.

AT SELECTION-SCREEN.
  PERFORM SSCR_USER_COMMAND.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.

  PERFORM SELECT_DATA.
  PERFORM MAKE_DISPLAY_DATA.
  PERFORM DISPLAY_DATA.
