*&---------------------------------------------------------------------*
*& Report ZEA_FI_BS
*&---------------------------------------------------------------------*
*& [FI] 대차대조표 프로그램 2024-04-24   [생성] ACA5-17 이세영
*&---------------------------------------------------------------------*
*& [2024.04.- / 단위 테스트 미진행] - [PM] 김건우 : -
*&---------------------------------------------------------------------*
* [수정 이력]
* 1. [ZEA_FI090_F01] - MOVE_DISPLAY_DATA
*    : 여기서 '당기순이익' SET 해오기.
*&---------------------------------------------------------------------*
REPORT ZEA_TREE_3 MESSAGE-ID ZEA_MSG.

INCLUDE ZEA_TREE_3_TOP.
*INCLUDE ZEA_FI_BS_2_TOP.   " 전역변수 선언
INCLUDE ZEA_TREE_3_CLS.
*INCLUDE ZEA_FI_BS_2_CLS.   " Local Class 정의구현
INCLUDE ZEA_TREE_3_PBO.
*INCLUDE ZEA_FI_BS_2_PBO.   " Screen 출력 전 Logic 처리 / PBO
INCLUDE ZEA_TREE_3_PAI.
*INCLUDE ZEA_FI_BS_2_PAI.   " Screen 출력 후 사용자에 의한 명령 처리
INCLUDE ZEA_TREE_3_F01.
*INCLUDE ZEA_FI_BS_2_F01.    " Form Subroutines 모음

*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.

*----------------------------------------------------------------------*
* AT SELECTION SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.

*----------------------------------------------------------------------*
* AT SELECTION SCREEN
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM GET_DATA. "자산
  PERFORM GET_DATA2. "부채
  PERFORM GET_DATA3. "자본

  " []는 인터널 테이블에 담겨있는 내용을 의미, 즉 쌓여있는 데이터
  IF GT_DATA[] IS INITIAL. " => 한 줄도 없는지 검사
    MESSAGE '검색된 결과가 없습니다.' TYPE 'S' DISPLAY LIKE 'W'.
  ELSE.
    CALL SCREEN 0100.
  ENDIF.
