*&---------------------------------------------------------------------*
*& Report ZEA_TR_TEM2
*&---------------------------------------------------------------------*
*& [2024.04.18 / 단위 테스트 완료] - [PM] 김건우 : o
*&---------------------------------------------------------------------*
REPORT ZEA_PP050 MESSAGE-ID OO.

INCLUDE ZEA_PP050_TOP. " 전역변수 선언

INCLUDE ZEA_PP050_SCR. " Selection Screen 구성

INCLUDE ZEA_PP050_CLS. " Local Class 정의구현

INCLUDE ZEA_PP050_PBO. " Screen 출력 전 Logic 처리 / PBO

INCLUDE ZEA_PP050_PAI. " Screen 출력 후 사용자에 의한 명령 처리

INCLUDE ZEA_PP050_F01. " Form Subroutines 모음


*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.

*----------------------------------------------------------------------*
* AT SELECTION SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.

*----------------------------------------------------------------------*
* AT SELECTION SCREEN
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM GET_DATA.
  PERFORM DISPLAY_DATA.
