*&---------------------------------------------------------------------*
*& Report ZEA_FI070
*&---------------------------------------------------------------------*
*& [FI] A/P 자동지급 프로그램 2024.04.18 [생성] ACA5-17 이세영
*& [FI] A/P 자동지급 프로그램 2024.04.23 [완료] ACA5-17 이세영
*&---------------------------------------------------------------------*
*& [2024.04.23 / 단위 테스트 완료] - [PM] 김건우 : o
*&---------------------------------------------------------------------*
* [수정 이력]
* 1. 2024-04-18 (~13:30)
* Selection Screen / 변수 수정 / 테이블 수정 (0)
* 2. 2024-04-16 (20:46)
* 팝업 다이올로그 띄우기, 대량 지급 처리 진행
* 3. 2024-04-22 (00:10)
*  저장 및 예약 처리 진행 (KZ 함수 생성 및 작동 구현) => (0)
*  ZEA_BSEG , ZEA_BKPF 전표 테이블 내 전표 정상 작동확인 (0)
* 4. 2024-04-22 (02:27)
*  A/P 지급 이후 벤더에게 지급건에 대한 Notice 기능 (0)
* 5. 2024-04-23 (12:00)
*  지급통지건 확인버튼 구현 (0)
*&---------------------------------------------------------------------*

INCLUDE ZEA_FI070_TOP.  " Global Data

INCLUDE ZEA_FI070_SCR.  " Selection screen

INCLUDE ZEA_FI070_CLS.  " ALV Events

INCLUDE ZEA_FI070_PBO.  " PBO-Modules

INCLUDE ZEA_FI070_PAI.  " PAI-Modules

INCLUDE ZEA_FI070_F01.  " FORM-Routines


**********************************************************************
* INITIALIZATION
**********************************************************************
INITIALIZATION.
  PERFORM SET_INIT_VALUE.

**********************************************************************
*  AT SELECTION SCREEN
**********************************************************************
AT SELECTION-SCREEN.

 AT SELECTION-SCREEN ON VALUE-REQUEST FOR SO_VENCO-LOW.
   PERFORM F4_NAME.

**********************************************************************
* START-OF-SELECTION
**********************************************************************
START-OF-SELECTION.

*--- Radio Button 선택 시 Select
  PERFORM GET_BASE_DATA.


*--- 검색 결과 Screen
  CALL SCREEN 100.
