*&---------------------------------------------------------------------*
*& Report ZEA_TEST_PP_FUNCTION
*&---------------------------------------------------------------------*
*& [PP-FI]        SA 전표 함수 테스트 프로그램
*&---------------------------------------------------------------------*
*& [생성일자 : 2024-04-20] / [생성자 : 5반 1조 이세영]
*& 완성도 [00%]
*&---------------------------------------------------------------------*
*& [프로그램 설명]
*& 생산오더 승인 시, MRP를 통해 계산된 원재료의 수가 감소
*& 생산실적 테이블 내 최종 생산량(FNPD) 만큼 완제품 수 증가
*&---------------------------------------------------------------------*
*& [MEMO]
*& 1. 2024-04-21 (19:26)
*&    : 현재 Test를 위해 해당 프로그램 로직을 짜는 것은 비효율적이라고 판단.
*&      타 프로그램 디테일 및 DB Table 내 데이터 값 체크를 먼저 진행하고자
*&      해당 Logic 작성은 하지 않겠음.
*&      PP 생산검수 프로그램 개발될 시 바로 함수 Test 진행하겠음.
*&---------------------------------------------------------------------*
REPORT ZEA_TEST_PP_FUNCTION.
