*&---------------------------------------------------------------------*
*& Report ZMEETROOM
*&---------------------------------------------------------------------*
*& [FI] 미결만기 관리 프로그램 2024.04.14 [생성] ACA5-17 이세영
*& [FI] 미결만기 관리 프로그램 2024.04.24 [완료] ACA5-17 이세영
*&---------------------------------------------------------------------*
* [수정 이력]
* 2024-04-16 (~16:00)
* 1. ALV 선택 시, 고객 데이터/전표 데이터 조회 구현 (O)
* 2. Radio Button 에 따라 조회 구현 (O)
*&---------------------------------------------------------------------*
* 2024-04-16 (20:46)
* 1. 날짜 검색 시 GT_DATA에 데이터 들어오지 않는 오류 개선 (O)
* 2. 2024-17 (~14:00) - 단위테스트요청
*&---------------------------------------------------------------------*
* [2024.04.18 / 단위 테스트 완료] - [PM] 김건우 : o
*&---------------------------------------------------------------------*
* [2024-04-24 / 고도화 진행 완료]
* 1. DZ 함수 적용 및 최적화
* 2. 독촉장 생성 기능 구현
*&---------------------------------------------------------------------*
* [2024-05-04 / 디테일 수정 완료]
* 1. DZ 함수 적용 및 최적화 (O)
* 2. 핫스팟 기능 적용 완료
*&---------------------------------------------------------------------*

INCLUDE ZEA_FI060_TOP.       " Global Data

INCLUDE ZEA_FI060_SCR.       " Selection screen

INCLUDE ZEA_FI060_CLS.       " ALV Events

INCLUDE ZEA_FI060_PBO.       " PBO-Modules

INCLUDE ZEA_FI060_PAI.       " PAI-Modules

INCLUDE ZEA_FI060_F01.       " FORM-Routines


**********************************************************************
* INITIALIZATION
**********************************************************************
INITIALIZATION.
  PERFORM SET_INIT_VALUE.

**********************************************************************
*  AT SELECTION SCREEN
**********************************************************************
AT SELECTION-SCREEN.

 AT SELECTION-SCREEN ON VALUE-REQUEST FOR SO_CSTAC-LOW.
   PERFORM F4_NAME.

**********************************************************************
* START-OF-SELECTION
**********************************************************************
START-OF-SELECTION.

*--- Radio Button 선택 시 Select
  PERFORM GET_BASE_DATA.


*--- 검색 결과 Screen
  CALL SCREEN 100.
